[
  {
    "type": "other_facilities",
    "data": [
      {
        "name": "Anna Auditorium",
        "description": "A spacious and well-equipped auditorium with modern audio-visual facilities, ideal for large events and gatherings with accommodation around 2500",
        "image_path": "/static/images/other_facilities/Anna Auditorium/Anna Auditorium 1.webp"
      },
      {
        "name": "Seminar Hall - Vivekananda Hall",
        "description": "Vivekananda Hall is an air-conditioned venue equipped with state-of-the-art facilities and can accommodate approximately 300 people",
        "image_path": "/static/images/other_facilities/Seminar Halls/Vivehananda Seminar Hall.webp"
      },
      {
        "name": "Seminar Hall - Placement Seminar Hall",
        "description": "Placement Seminar Hall is an air-conditioned venue equipped with state-of-the-art facilities and can accommodate approximately 120 people",
        "image_path": "/static/images/other_facilities/Seminar Halls/Vivehananda Seminar Hall.webp"
      },
      {
        "name": "Seminar Hall - Sarojini Naidu Seminar Hall",
        "description": "Sarojini Naidu Seminar Hall is an air-conditioned venue equipped with state-of-the-art facilities and can accommodate approximately 150 people",
        "image_path": "/static/images/other_facilities/Seminar Halls/Vivehananda Seminar Hall.webp"
      },
      {
        "name": "Seminar Hall - Billgate Seminar Hall",
        "description": "Billgate Seminar Hall is an air-conditioned venue equipped with state-of-the-art facilities and can accommodate approximately 50 people",
        "image_path": "/static/images/other_facilities/Seminar Halls/Vivehananda Seminar Hall.webp"
      },
      {
        "name": "On-Campus Medical Facility",
        "description": "Velammal Engineering College provides a full-time medical facility with a qualified doctor and nurse available to attend to any health emergencies. The medical center is equipped with basic necessary equipment, and an ambulance service is on standby to handle emergencies and ensure the well-being of students and staff.",
        "image_path": "/static/images/other_facilities/Health Centre/HC 1.webp"
      },
      {
        "name": "Reprographic Facility",
        "description": "The college has reprographic facility available for students which functions from 8:30 AM to 6:00 PM. It is located opposite to BILL GATES BLOCK in the Velammal Engineering College.",
        "image_path": "/static/images/other_facilities/Repographic Facility/RF 1.webp"
      },
      {
        "name": "Store",
        "description": "A well-stocked store providing essential academic supplies, stationery, and other student requirements.",
        "image_path": "/static/images/other_facilities/VE Store/VE Store 1.webp"
      },
      {
        "name": "Sewage Treatment Plant",
        "description": "The Sewage Treatment Plant is designed for a capacity of 2,00,000 LITRES/DAY. The plant operates 24x7 with regular maintenance, utilizing a three-stage treatment process: Primary Treatment: Bar screening and sedimentation in a Primary Clarifier. Secondary Treatment: Activated Sludge Process. Tertiary Treatment: Sand & Activated Carbon Filters for final polishing. The plant includes sludge drying beds and treated water storage.",
        "image_path": "/static/images/other_facilities/Sewage Plant/Sweage Plant 1.webp"
      },
      {
        "name": "RO (Reverse Osmosis)",
        "description": "The RO plant in the campus is designed for a Capacity of 5000L/hr. The treated water is pumped using the Pneumatic pumping system and distributed for drinking purpose in the campus. Regular maintenance of the plant is done and water tested to confirm that the quality meets BIS ( IS 10500:2012) standards.",
        "image_path": "/static/images/other_facilities/RO/RO 1.webp"
      },
      {
        "name": "Solar Power",
        "description": "Velammal Educational Trust established a 10 MW Solar P.N power plant at Manjalkudi Village, commissioned on 19.03.2019, in alignment with central and state renewable energy policies.",
        "image_path": "/static/images/other_facilities/Solar Power/SP 1.webp"
      },
      {
        "name": "Student Counseling Services",
        "description": "Our college provides a full-time qualified Student Counselor to support students' academic, emotional, and personal well-being, ensuring a healthy and positive learning environment.",
        "image_path": "/static/images/other_facilities/Student Councellor/Student Councellor.webp"
      },
      {
        "name": "Transport",
        "description": "Our college offers fully air-conditioned buses covering all major routes across the city, ensuring comfortable and convenient transportation for students.",
        "image_path": "/static/images/other_facilities/Transport/Bus View 1.webp"
      },
      {
        "name": "High-Speed Internet Facility",
        "description": "Our college provides a 1 Gbps high-speed internet connection, ensuring seamless access to online resources, research materials, and digital learning platforms for students and faculty.",
        "image_path": "/static/images/other_facilities/High Speed Internet Facility/Airtel 1.webp"
      },
      {
        "name": "Group Insurance Policy",
        "description": "Our institution provides a comprehensive Group Insurance Policy through United India Insurance covering: Teaching & Non-Teaching Staff: 433 members, Students: 3,522 members.",
        "image_path": "/static/images/other_facilities/Group Insurance Policy/RSA 1.webp"
      },
      {
        "name": "Faculty Accommodation",
        "description": "Velammal Engineering College has faculty quarters with 16 single-bedroom and 16 two-bedroom houses. These quarters provide convenient on-campus accommodation for faculty, encouraging academic engagement and participation.",
        "image_path": "/static/images/other_facilities/Faculty Accomodation/Faculty Accomodation 1.webp"
      },
      {
        "name": "Spacious Food Canteen",
        "description": "Our college has a well-equipped canteen with ample seating capacity to accommodate a large number of students, offering hygienic and nutritious meals in a comfortable dining environment.",
        "image_path": "/static/images/other_facilities/Canteen/Canteen 1.webp"
      },
      {
        "name": "Fire Extinguisher",
        "description": "Velammal Engineering College has comprehensive fire safety measures including fire extinguishers, sand buckets, and strategically placed water hoses across all blocks.",
        "image_path": "/static/images/other_facilities/Fire Safety/FS 1.webp"
      },
      {
        "name": "Power Backup",
        "description": "Uninterrupted power supply with backup generators to ensure continuous academic and administrative activities.",
        "image_path": "/static/images/other_facilities/Power Backup/PB 1.webp"
      },
      {
        "name": "Surveillance & Security",
        "description": "A robust CCTV surveillance system with 24/7 monitoring by security staff ensures student safety. Strategic camera placements and trained personnel help prevent unauthorized access and maintain order.",
        "image_path": "/static/images/other_facilities/Security/CCTV 1.webp"
      },
      {
        "name": "Gym Facility",
        "description": "Our college features a modern gym with essential fitness machines and equipment, promoting a healthy and active lifestyle for students and staff.",
        "image_path": "/static/images/other_facilities/Gym/fitnesscenter.webp"
      },
      {
        "name": "Temple",
        "description": "Our college features a modern Velmurugan temple to provide better lifestyle for students and staff.",
        "image_path": "/static/images/other_facilities/Temple/Temple.webp"
      }
    ]
  }
]
