[
    {
        "dept_id": "001",
        "department_name": "Artificial Intelligence and Data Science (AI&DS)",
        "content": "Students' achievements are a testament to their hard work, dedication, and resilience in the pursuit of academic and personal growth. From excelling in academics and securing top grades to showcasing talent in sports, arts, and extracurricular activities, their accomplishments reflect a well-rounded development. Participation in science fairs, debates, and cultural events highlights their creativity and critical thinking, while community service projects demonstrate their commitment to making a positive impact. These achievements not only inspire their peers but also pave the way for future opportunities, building confidence and a strong foundation for lifelong success.",
        "images": [
    {"image_path": "/static/images/student_activities/001/1.webp", "event_name": "Paper Presentation (2nd Prize)", "image_content": "III year students of the AI&DS department won second prize in the paper presentation held at Saveetha Engineering College on 23.08.24. Paper Title: 'Are Women Safe in India?", "date": "2024-08-23"},
    {"image_path": "/static/images/student_activities/001/2.webp", "event_name": "Paper Presentation (2nd Prize)", "image_content": "III year students of our department won second prize in the paper presentation held at Saveetha Engineering College on 23.08.24. Paper Title: 'Preventing Fake Social Media Profiles and Reporting", "date": "2024-08-23"},
    {"image_path": "/static/images/student_activities/001/3.webp", "event_name": "Paper Presentation (1st Prize)", "image_content": "III year students, Vasantha Raja and Roshan Varghese, won 1st prize in the Paper Presentation held at Saveetha Engineering College on 27/8/2024. They were awarded a trophy and a cash prize of Rs.1000.", "date": "2024-08-27"},
    {"image_path": "/static/images/student_activities/001/4.webp", "event_name": "IPL Auction Event", "image_content": "II year student Tharun. M participated in the IPL Auction event conducted by the Mechanical Department of Velammal Engineering College and won First place with a prize of Rs.1500", "date": "2024-08-24"},
    {"image_path": "/static/images/student_activities/001/5.webp", "event_name": "Technoxian World Cup Participation", "image_content": "AI&DS Department student T. Vishal Raj of Final year participated in the Maze Solver Challenge of Technoxian World Cup 2024, held at Noida Stadium Complex, Noida from 24th-27th August 2024.", "date": "2024-08-24"},
    {"image_path": "/static/images/student_activities/001/6.webp", "event_name": "Football Tournament", "image_content": "AI&DS Department student Lokharajan of III year won third place in the football tournament conducted by Velammal Institute of Technology.", "date": "2024-09-01"},
    {"image_path": "/static/images/student_activities/001/7.webp", "event_name": "CM Trophy Basketball Match", "image_content": "AI&DS Department student Mugunthan Balaji from II year achieved Runner-up in the CM Trophy basketball match conducted at __________________.", "date": "2024-09-05"},
    {"image_path": "/static/images/student_activities/001/8.webp", "event_name": "INNOTHON-24 Hackathon", "image_content": "AI&DS Department students Pranesh Kumar, Siddarth, Sriram, Arjun, and Mohamed Yasir won First Place in the Hackathon (INNOTHON-24) conducted by KCG College of Engineering and won a cash prize of Rs.25000 on 21-9-2024.", "date": "2024-09-21"},
    {"image_path": "/static/images/student_activities/001/9.webp", "event_name": "Zonal Level Volleyball Tournament", "image_content": "AI&DS Department II year student Thamizhvendhan won 3rd place in the Zonal level volleyball tournament conducted by RMK Engineering College on 26-9-2024.", "date": "2024-09-26"},
    {"image_path": "/static/images/student_activities/001/10.webp", "event_name": "Zonal Level Basketball Tournament", "image_content": "AI&DS Department II year student Mugunthan Balaji won 2nd place in the Zonal level basketball tournament conducted by RMK Engineering College on 26-9-2024.", "date": "2024-09-26"},
    {"image_path": "/static/images/student_activities/001/11.webp", "event_name": "Tamilnadu Powerlifting Championship", "image_content": "AI&DS department Student Mr.Dhiyaneshwar won 1st place in the Tamilnadu power lifting championship conducted by Thiruvarur District Powerlifting Association on 27-9-2024", "date": "2024-09-27"},
    {"image_path": "/static/images/student_activities/001/12.webp", "event_name": "Paper Presentation (2nd Prize)", "image_content": "Madhumitha B, III Year Student won 2nd prize and a cash award of Rs.500 in paper presentation (Paper Pitch) on 15-3-2025 at the technical symposium conducted by New Prince Shri Engineering College.", "date": "2025-03-15"},
    {"image_path": "/static/images/student_activities/001/13.webp", "event_name": "Paper Presentation (2nd Prize)", "image_content": "Madhumitha B, III Year Student won 2nd prize and a cash award of Rs.1000 in paper presentation on 14-3-2025 at the technical symposium conducted by Veltech Multitech College.", "date": "2025-03-14"},
    {"image_path": "/static/images/student_activities/001/14.webp", "event_name": "Hackathon (Winner)", "image_content": "Trisha and Jasmine of final year AI&DS won Rs.10000 in a hackathon conducted by Sona College of Technology – Salem on 14-3-2025.", "date": "2025-03-14"},
    {"image_path": "/static/images/student_activities/001/15.webp", "event_name": "Intramural Football Match", "image_content": "AI&DS dept boys won first place in Football match at the Intramural Competition held on 7-3-2025 at VEC.", "date": "2025-03-07"},
    {"image_path": "/static/images/student_activities/001/16.webp", "event_name": "Spidy grooves- Tunes and Tales", "image_content": "Monisha and Deekshitha of II B won FIRST PRIZE in Spidy Grooves - Tunes and Tales (Non-Tech event) at the Symposium held in Sri Sai Ram Institute of Technology on 12-3-2025.", "date": "2025-03-12"},
    {"image_path": "/static/images/student_activities/001/17.webp", "event_name": "Powerlifting (2nd Prize)", "image_content": "III Year Student Dhiyaneshwar won 2nd place under 93kg men Powerlifting held at Pavai Engineering College on 21-12-2025.", "date": "2025-12-21"},
    {"image_path": "/static/images/student_activities/001/18.webp", "event_name": "Paper Presentation (1st Prize)", "image_content": "Nithyashrie G and Nivedhitha of II B won FIRST PRIZE in paper presentation held in Sri Sai Ram Institute of Technology on 12-3-2025. They were awarded with certificates and a cash prize of Rs.1000.", "date": "2025-03-12"},
    {"image_path": "/static/images/student_activities/001/19.webp", "event_name": "Paper Presentation (2nd Prize)", "image_content": "Sathya Ruba and Devika of 2nd Year won 2nd prize in paper presentation conducted by Jeppiar Institute of Technology on 21-2-2025. Cash prize awarded.", "date": "2025-02-21"},
    {"image_path": "/static/images/student_activities/001/20.webp", "event_name": "Paper Presentation (2nd Prize)", "image_content": "Samyuktha, Shunmugapriya, and NithyaSri of second year won 2nd prize in the paper presentation conducted by Jeppiaar Institute of Technology on 21-2-2025. Cash prize awarded.", "date": "2025-02-21"}
  ]
  },
    {
        "dept_id": "002",
        "department_name": "Automobile Engineering (AUTO)",
        "content": "",
        "images": [
            {"image_path": "/static/images/student_activities/002/1.webp", "event_name": "Supra 2015", "image_content": "In 2015, our students showcased their engineering skills and innovation by participating in the SUPRA SAEINDIA event, a national-level competition where budding engineers design, build, and race a Formula-style vehicle. This hands-on experience provided our students with valuable exposure to vehicle dynamics, powertrain optimization, and design validation, fostering technical expertise and teamwork. Their participation in SUPRA 2015 reflects our commitment to nurturing industry-ready engineers equipped with practical knowledge and a passion for automotive excellence.", "date": "2015-07-15"},
            {"image_path": "/static/images/student_activities/002/2.webp", "event_name": "International Go-Kart Championship", "image_content": "Our department is proud to highlight the outstanding participation of our students in the International Go-Kart Championship (IGC) 2015, held at Lovely Professional University, Punjab. This prestigious event provided a platform for young engineers to design, fabricate, and race their own Go-Karts, applying their technical knowledge and innovative thinking. Our students demonstrated exceptional skills in vehicle design, powertrain integration, and performance optimization, competing against teams from across the country.Lovely Professional University, Punjab", "date": "2015-03-26"},
            {"image_path": "/static/images/student_activities/002/3.webp", "event_name": "ATV Student Grand Prix -2K17", "image_content": "Our department is thrilled to celebrate the remarkable achievement of our students in the ATV Student Grand Prix - 2K17, where they showcased their engineering expertise and innovation. Competing against top teams, our students designed and built an All-Terrain Vehicle (ATV), demonstrating excellence in vehicle dynamics, suspension, and powertrain optimization. Their dedication and technical prowess were recognized with the prestigious Best Design Award, a testament to their creativity, problem-solving skills, and teamwork. This achievement reflects our institute's commitment to fostering hands-on learning and preparing industry-ready engineers equipped with real-world experience.", "date": "2017-02-04"},
            {"image_path": "/static/images/student_activities/002/4.webp", "event_name": "SAE BAJA 2018 ", "image_content": "Our department proudly celebrates the outstanding achievement of our students in SAE BAJA 2018, where they secured third place for Best Design. This prestigious competition challenged students to design, build, and race an All-Terrain Vehicle (ATV) capable of withstanding rugged terrains and extreme conditions. Our team demonstrated exceptional skills in vehicle engineering, innovation, and design optimization, earning them national recognition. This remarkable accomplishment highlights their dedication, teamwork, and technical expertise, reinforcing our institute's commitment to practical learning and excellence in automotive engineering.", "date": "2018-01-24"},
            {"image_path": "/static/images/student_activities/002/5.webp", "event_name": "Yoga Competition - 2018", "image_content": "Our department takes immense pride in congratulating Mr. T.V. Sreesh for his outstanding achievement in the National Yoga Competition - 2018, where he secured the prestigious Gold Medal. His dedication, discipline, and exceptional skills in yoga have brought great honor to our institution. This remarkable accomplishment showcases his commitment to physical and mental well-being, inspiring fellow students to strive for excellence in both academics and extracurricular activities. We applaud his success and wish him continued achievements in the future.", "date": "2018"},
            {"image_path": "/static/images/student_activities/002/6.webp", "event_name": "SAEISS - Bicycle Design Challenge 2024", "image_content": "Our department is proud to announce that our students achieved an outstanding milestone in the SAEISS Bicycle Design Challenge 2024, securing 3rd place in Best Dynamic Performance. This prestigious competition challenged teams to design and develop an innovative, high-performance bicycle with a focus on efficiency, aerodynamics, and sustainability. Our students demonstrated exceptional engineering skills, creativity, and teamwork, excelling in dynamic performance tests. This achievement highlights their dedication to practical learning and innovation, reinforcing our institute's commitment to fostering future-ready engineers.", "date": "2024-02-25"},
            {"image_path": "/static/images/student_activities/002/7.webp", "event_name": "University first rank ", "image_content": "Our department is immensely proud to congratulate B. Hariganesh for securing the University First Rank and winning the Gold Medal in Automobile Engineering for the batch of 2017-2021. His outstanding academic performance, dedication, and passion for automotive engineering have brought great honor to our institution. This remarkable achievement reflects his hard work and commitment to excellence, serving as an inspiration for future students.", "date": "2021"},
            {"image_path": "/static/images/student_activities/002/8.webp", "event_name": "SAE - Foundation Section Award 2023 - 2024", "image_content": "Our department proudly congratulates G. Gopika, a 3rd-year Automobile Engineering student, for receiving the prestigious SAE - Foundation Section Award 2023-2024 under the Kalpana Chawla category. This esteemed recognition honors her exceptional academic performance, technical expertise, and contributions to the field of automotive engineering. Her achievement is a testament to her dedication, hard work, and passion for innovation. We celebrate her success and look forward to witnessing her future accomplishments in the industry.", "date": "2024-12-21"},
            {"image_path": "/static/images/student_activities/002/9.webp", "event_name": "SAEISS - Electric Two Wheeler Design Competition", "image_content": "Our department is proud to announce that our students actively participated in the SAEISS - Electric Two-Wheeler Design Competition, showcasing their expertise in sustainable mobility and innovative vehicle design. This competition provided a platform to develop an electric two-wheeler with a focus on efficiency, performance, and eco-friendly technology. Our team demonstrated exceptional skills in battery technology, powertrain integration, and aerodynamic design, gaining valuable hands-on experience in the evolving field of electric vehicles. Their participation reflects our institute's commitment to fostering innovation and industry-relevant learning in the field of automobile engineering.", "date": "2025-01-25"},
            {"image_path": "/static/images/student_activities/002/10.webp", "event_name": "Smart India Hackathon 2024", "image_content": "Our department is proud to announce that our students successfully participated in the Smart India Hackathon 2024 Grand Finale, a prestigious national-level innovation challenge. Competing against top teams from across the country, our students showcased their problem-solving abilities, technical expertise, and creativity in developing innovative solutions for real-world challenges. Their participation in this esteemed event reflects their dedication to research, innovation, and technological advancement, reinforcing our institute's commitment to fostering future-ready engineers equipped with industry-relevant skills.", "date": "2024-12-11"},
            {"image_path": "/static/images/student_activities/002/11.webp", "event_name": "MSME, Idea Hackathon 3.0", "image_content": "Our department proudly congratulates G. Gopika, a 3rd-year Automobile Engineering student, for securing a grant of ₹10.1 Lakhs from MSME Idea Hackathon 3.0 for her innovative project of Automatic billing machine in grocery shop. This prestigious funding recognizes her exceptional creativity, technical expertise, and entrepreneurial spirit in developing groundbreaking solutions in the automotive sector. Her achievement is a testament to her dedication and problem-solving skills, bringing pride to our institution. We celebrate her success and look forward to witnessing her future contributions to the industry.", "date": "2024-03-14"},
            {"image_path": "/static/images/student_activities/002/12.webp", "event_name": "SAEISS - Electric Two-Wheeler Design Competition", "image_content": "Our department is proud to announce that our students actively participated in the SAEISS - Electric Two-Wheeler Design Competition, demonstrating their innovation and technical expertise in the field of sustainable mobility. This competition provided them with a platform to design and develop an efficient electric two-wheeler, focusing on battery technology, power management, aerodynamics, and performance optimization. Their participation highlights their dedication to cutting-edge automotive advancements and reinforces our institute's commitment to fostering future engineers equipped with industry-relevant skills in electric vehicle technology.", "date": "2024-02-17"}
        ]
    },
    {
        "dept_id": "004",
        "department_name": "Civil Engineering (CIVL)",
        "content": "",
        "images": [
            {"image_path": "/static/images/student_activities/004/1.webp", "event_name": "Anna University   Civilization - 2024 - Overall Championship ", "image_content": "VEC Civil Engineering Department won the Overall Championship of Civilization - a national level technical symposium conducted by College of Engineering, Guindy, Anna University consecutively for 7 years.", "date": "2024"},
            {"image_path": "/static/images/student_activities/004/2.webp", "event_name": "ANNA UNIVERSITY   CIVILIZATION - 2022 - OVERALL CHAMPIONSHIP (Students Won Anna University Civilization Overall Championship Trophy for the last 7 consecutive years)", "image_content": "Our Students were awarded 4 funded projects through IEDC for innovative project and products", "date": "2022"},
            {"image_path": "/static/images/student_activities/004/3.webp", "event_name": "Overall Trophy in Inter-collegiate symposium conducted by Dayanand Sagar College of Engineering and Technology,Bengaluru,2022 ", "image_content": "Our Students were awarded 5 Final Year funded projects by TNSCST for modern project works", "date": "2022"},
            {"image_path": "/static/images/student_activities/004/4.webp", "event_name": "First Prize in BAI Oratorical Competition 2021", "image_content": "Our Students have been winning prizes every year since 2016 in the BAI - builders’ Association of India Oratory Competition.", "date": "2021"}
        ] },
        {
            "dept_id": "005",
            "department_name": "Computer Science & Engineering (CSE)",
            "content": "",
            "images": [
                {"image_path": "/static/images/student_activities/005/1.webp", "event_name": "Code Debugging ", "image_content": "Mr.R. Prasath, K. Logendiran, KM. Udaya Krishna has won first place in Code Debugging event with a Cash  Award of 5000/- held at VelTech Engineering College ", "date": "2025-02-14"},
                {"image_path": "/static/images/student_activities/005/2.webp", "event_name": "Matter Mind", "image_content": "Mr.R. Prasath, S R Jefrin Jijo has won second place in Matter Mind event with a cash prize of 1000/- held at Jerusalem Engineering College ", "date": "2025-02-15"},
                {"image_path": "/static/images/student_activities/005/3.webp", "event_name": "Code Debugging ", "image_content": "Mr. K M. Udaya Krishna and P.Sri Sai Charan has won Second place in Code Debugging event with a Cash Prize  held at Jerusalem Engineering College ", "date": "2025-02-15"},
                {"image_path": "/static/images/student_activities/005/4.webp", "event_name": "Exdathon", "image_content": "MrRageshwaran, Mr.Tarakeshwaran and Mr.Praveen kumar has won Second place Exdathon event with a Cash Prize  of 7000/- held at SRM Engineering College ", "date": "2024-08-28"},
                {"image_path": "/static/images/student_activities/005/5.webp", "event_name": "Lingo Flow", "image_content": "Vyshnavi N D D, Fahrudeen and Hamil Haasan has won second place in Lingo Flow Event at KK Wagh Institute of Engineering Education & Research ", "date": "2025-02-02"},
                {"image_path": "/static/images/student_activities/005/6.webp", "event_name": "Techathon", "image_content": "Kamilhaasan A, Abinand P and Fahrudeen M has won first place in Techathon - AI/ML Challenge at IIT Madras Shaastra ", "date": "2024-09-28"}
            ]
        },
    {
        "dept_id": "006",
        "department_name": "Computer Science and Engineering (CYBER SECURITY)",
        "content": "Student’s achievements are a testament to their hard work, dedication, and resilience in the pursuit of academic and personal growth. Excelling in academics and securing top grades showcase their commitment to learning, while their talent in sports, arts, and extracurricular activities reflects well-rounded development. Participation in science fairs, debates, and cultural events highlights their creativity and critical thinking, while involvement in community service projects demonstrates their commitment to making a positive impact. These accomplishments not only inspire their peers but also open doors to future opportunities, building confidence and laying a strong foundation for lifelong success.",
        "images": [
            {"image_path": "/static/images/student_activities/006/1.webp", "event_name": "South India Championship at Hyderabad in powerlifting", "image_content": "II year Student ABISHEK PAUL JOSHUA VS Won Gold Medal and Overall Championship in power lifting held by South India Championship at Hyderabad in powerlifting on the academic year   2024-2025 , he was awarded with a medal and a trophy", "date": null},
            {"image_path": "/static/images/student_activities/006/2.webp", "event_name": "National Powerlifting Championship", "image_content": "II year Student ABISHEK PAUL JOSHUA VS Won bronze Medal in National Powerlifting Championship  organized by Chhattisgarh Power Lifting Association  at Chhattisgarh on the academic year   2024-2025 ", "date": null},
            {"image_path": "/static/images/student_activities/006/3.webp", "event_name": "Hyperledger India Chapter Student Society Technial Quiz", "image_content": "II year student GURUPRASANTH M and ADARSH AG Won FIRST AND SECOND price in technical quiz held on 21 January 2025 organized by Hyperledger India Chapter Student Society Chapter- VEC : Blockchain Club ", "date": "2025-01-21"}
        ]
    },
    {
        "dept_id": "007",
        "department_name": "Electrical & Electronics Engineering (EEE)",
        "content": "The students of the EEE department have consistently demonstrated their technical prowess by actively participating in various competitions, including project expos, paper presentations, circuit design challenges, and robotics competitions at inter-college and university levels. Their innovative research and problem-solving abilities have earned them recognition at prestigious technical symposiums and conferences. Notably, our students have presented papers on emerging technologies such as Smart Grids, Renewable Energy Systems, Electric Vehicles, and Industrial Automation, showcasing their expertise and dedication to the field. Their achievements reflect the department’s strong emphasis on academic excellence, research, and hands-on learning, inspiring future engineers to push the boundaries of innovation.",
        "images": [
            {"image_path": "/static/images/student_activities/007/1.png", "event_name": "SAEINDIA Electric Two Weeler Design Competition", "image_content": "LakshmanRaj of EEE  won 1st prize in SAEINDIA Electric Two Weeler Design Competition -2023 and received Rs10,000 Cheque", "date": "2023-07-23"},
            {"image_path": "/static/images/student_activities/007/2.png", "event_name": "National Level Symposium VERSIO 22", "image_content": "Best Paper Award titled 'Smart Assistance With Motion Detecting Sensor received by S Devi Priya,M Pavithraa  & A P Sritharani at National Level Symposium VERSIO 22, SRM Ramapuram Campus", "date": "2022"},
            {"image_path": "/static/images/student_activities/007/3.png", "event_name": "National Level Symposium Impulse 22", "image_content": "Won 2nd  Prize in Paper Presentation titled “Smart Celling System” by Gayathri B M at National Level Symposium, Impulse 22 held  at Chennai Institute Of Technology", "date": "2022"},
            {"image_path": "/static/images/student_activities/007/4.png", "event_name": "National Level Symposium INSTRUBLITZ 22", "image_content": "Won 3rd Prize in paper presentation event titled, 'Solar Charging Electric Vehicle' by T Thakshana  & M Siddharth at National Level Symposium INSTRUBLITZ 22 held at SRM Eswari Engineering College.", "date": "2022"},
            {"image_path": "/static/images/student_activities/007/5.png", "event_name": "National Level Symposium GENERIX 22", "image_content": "Won 1st prize in paper presentation titled 'Gesture based door control system using SOC FPGA' by Joan Daniel A & Sugunesan R at National Level Symposium GENERIX 22, R.M.D Engineering College ", "date": "2022"},
            {"image_path": "/static/images/student_activities/007/6.png", "event_name": "Gnista 22", "image_content": "Won 2nd Prize in paper presentation titled  “Power Transformer Differential Protection Based on Current and Voltage Ratio” by Jayashree M & Harini R  Gnista 22 TJS Engineering College.", "date": "2022"},
            {"image_path": "/static/images/student_activities/007/7.png", "event_name": "IIT Madra's Carbon Zero Challenge", "image_content": "Mr. Sachin gets the award along with Scarpify Ecotech Pvt Ltd team at IIT Madra's Carbon Zero Challenge", "date": null}
        ]
    },
    {
        "dept_id": "008",
        "department_name": "Electronics & Instrumentation Engineering  (EIE)",
        "content": "",
        "images": [
            {"image_path": "/static/images/student_activities/008/1.webp", "event_name": "EDII's Hackathon-2024  ", "image_content": "Priya V, Anushaa J and Sivapriya B of Final year Electronics and Instrumentation Engineering students  have won 1st Runner up Position in EDII's Hackathon-2024  and received the Cash Prize of Rs. 25,000  from Honourable MSME Minister, Mr. Anbarasan at Anna University", "date": null},
            {"image_path": "/static/images/student_activities/008/2.webp", "event_name": "NATIONAL ENTREPRENEURSHIP CONCLAVE 2.0", "image_content": "DEEPIKA D AND SHIVA RANJANI PASUPATHY OF III YEAR SECURE 41ST POSITION (TOP 50) OUT OF 170 TEAMS AND WON CASH AWARD OF RS. 5,000/- AT  NATIONAL ENTREPRENEURSHIP CONCLAVE 2.0BY LEAD COLLEGE OF MANAGEMENT, DHONI, PALAKKAD, KERALA", "date": null},
            {"image_path": "/static/images/student_activities/008/3.webp", "event_name": "Computational Intelligence and Industry 5.0", "image_content": "Anushaa J, Chandrika Devi V, Priya V  of III YR EIE presented a paper in International Conference on “Computational Intelligence and Industry 5.0” conducted by Velammal Institute of Technology in the title “Integrated Non-Invasive Continuous Blood Glucose, SPO2 and BPM Monitoring” and won best paper Award", "date": null},
            {"image_path": "/static/images/student_activities/008/4.webp", "event_name": "Zone -I Tournament ", "image_content": "KARTHIKEYAN R and RUPAK S R  of II YEAR EIE are in  Kho Kho men Team who won Zone -I Tournament held at Prathyusha Engineering college, Thiruvallur", "date":null },
            {"image_path": "/static/images/student_activities/008/5.webp", "event_name": "Paper Presentation", "image_content": "DINESH KUMAR J, PRIYA V, PRATHEEP S of III YR EIE won First Prize with cash award of Rs. 1500/- in paper presentation held at Madras Institute of Technology ", "date": "2024-03-16"},
            {"image_path": "/static/images/student_activities/008/6.webp", "event_name": "Innomasters'24 Business Model Event ", "image_content": "DEEPIKA D AND SHIVA RANJANI PASUPATHY OF III YEAR SECURE won 1st prize with cash award of Rs 25,000  in the Innomasters'24 Business Model Event conducted by vel tech University, Avadi", "date": null},
            {"image_path": "/static/images/student_activities/008/7.webp", "event_name": "MODEL PRESENTATION ", "image_content": "PRIYA V, MALINI R, ANUSAHAA J OF III YEAR WON FIRST PRIZE WITH CASH AWARD OF RS. 25,000/-   IN MODEL PRESENTATION CONDUCTED BY GITAM, DEEMED UNIVERSITY, VISAKHAPATNAM ", "date": "2023-11-04"},
            {"image_path": "/static/images/student_activities/008/8.webp", "event_name": "STARTUP SHOWCASE ", "image_content": "PRIYA V AND MALINI R OF III YEAR WON FIRST PRIZE WITH CASH AWARD OF RS. 25,000/-   IN STARTUP SHOWCASE CONDUCTED BY GITAM, DEEMED UNIVERSITY, VISAKHAPATNAM ", "date": "2023-11-04"},
            {"image_path": "/static/images/student_activities/008/9.webp", "event_name": "PAPER PRESENTATION ", "image_content": "CHANDRIKA DEVI V AND PRIYA V OF III YEAR WON SECOND PRIZE WITH CASH AWARD OF RS. 2,000/-   IN PAPER PRESENTATION CONDUCTED BY ST. JOSEPH'S INSTITUTE OF TECHNOLOGY ", "date": "2023--08-05"},
            {"image_path": "/static/images/student_activities/008/10.webp", "event_name": "ZONALS FOOTBALL MATCH ", "image_content": "ENITH AUSTIN OF III YR WON ANNA UNIVERSITY ZONALS FOOTBALL MATCH AT VEL TECH HIGH TECH, AVADI ", "date": "2023-10-11"},
            {"image_path": "/static/images/student_activities/008/11.webp", "event_name": "INTERZONAL TAEKWONDO TOURNAMENT ", "image_content": "RUPAK OF II YR WON GOLD MEDAL IN INTERZONAL TAEKWONDO TOURNAMENT AND GOT SELECTED TO NATIONALS ", "date":null},
            {"image_path": "/static/images/student_activities/008/12.webp", "event_name": "Indian International Science Festival IISF-2021", "image_content": "Mr. S. PraveenKumar of Final year EIE Student won 2nd prize in the event Indian International Science Festival IISF-2021, held at Goa", "date": "2021-12-12"}
        ]
    },
    {
        "dept_id": "009",
        "department_name": "Electronics and Communication Engineering (ECE)",
        "content": "",
        "images": [
            {"image_path": "/static/images/student_activities/009/1.webp", "event_name": "RAISEathon", "image_content": "Raj Kisan ,Santhosh M, Vijay A, Shalini Agnes Mary A  won 1st place and a cash prize of 300000lakhs in RAISEathon", "date":null },
            {"image_path": "/static/images/student_activities/009/2.webp", "event_name": "omega 24", "image_content": "Raj Kisan  Santhosh M Monisha  Vijay A Shalini Agnes Mary A won First place  in hackathon and second price in paper presentation in Hindustan College omega 24 Symposium", "date":null},
            {"image_path": "/static/images/student_activities/009/3.webp", "event_name": "Essay competition", "image_content": "Saravana kumar won 3rd place in Essay competition conducted by Govt of India", "date": null},
            {"image_path": "/static/images/student_activities/009/4.webp", "event_name": " paper presentation", "image_content": "Anshul , Dinesh Kumar , Santhosh S , Yeswanth Bala  won  2nd place in paper presentation held at DR.MGR University.", "date": null},
            {"image_path": "/static/images/student_activities/009/5.webp", "event_name": " paper presentation", "image_content": "Jeevath , Praveen ,Sivaram, Elumalai won  2nd place in paper presentation held at sri sairam Institute of Technology.", "date": null   },
            {"image_path": "/static/images/student_activities/009/6.webp", "event_name": "Paper Presentation", "image_content": " Lincy J.M ,Vijaythri  won 3rd place in paper presentation held at DR.MGR University", "date": null},
            {"image_path": "/static/images/student_activities/009/7.webp", "event_name": "Clue crackers", "image_content": "Jerin S, Arvind Krishnan K,Siva Ram.P  won 3rd Clue crackers event held at St.Joseph Institute of technology.", "date": "YYYY-MM-DD"},
            {"image_path": "/static/images/student_activities/009/8.webp", "event_name": "the 34th DAE All India Essay Contest ", "image_content": "Mr.R.SARAVANAKUMAR, B.E.ECE, II-YEAR (2nd from left) is the only student participated from Tamilnadu and won III- Prize. He received a cash award of Rs.15,000/- with Free Travel, Boarding and Accommodation Allowances for his essay on “Nuclear Power-Secured Energy Source towards Atmanirbhar Bharat” at the 34th DAE All India Essay Contest on “Nuclear Science and Technology” during the Celebration of 75 Years of Independence, organized by the Department of Atomic Energy, Government of India, from 26.10.2022 to 31.10.2022 at Mumbai. ", "date": "2022-10-26"},
            {"image_path": "/static/images/student_activities/009/9.webp", "event_name": "KLA Hackathon ", "image_content": "Ms.Shreenidhi. G (2nd Prize) (2nd from left) and Naveena. R (special mention) (1st from left) of III year ECE students Won 2 awards in KLA Hackathon 2023 and received cash prize of Rs 20,000 totally.", "date": "YYYY-MM-DD"},
            {"image_path": "/static/images/student_activities/009/10.webp", "event_name": "Mobile Kiosk for Fish vending", "image_content": "Mr. Yokesh J – (2022-23) ( 6th from left) received the Certificate of Merit from Shri Jatindra Nath Swain, I.A.S., Secretary, Department of Fisheries, Ministry of  Fisheries, Animal Husbandry & Dairying, Government of Indiaunder the category  “National Design Challenge on Innovative design of Mobile Kiosk for Fish vending” conducted by CII. Felicitation ceremony was held on 27.10.2022 at   Gulmohar Hall,  Habitat Centre, Delhi.", "date": "2022-10-27"},
            {"image_path": "/static/images/student_activities/009/11.webp", "event_name": "Accenture Innovation Challenge ", "image_content": "Faheem Jina, Yokesh and Harini  of our  IV year ECE students won the Finals in  Accenture Innovation Challenge Competition 2021 and each received Apple iMac worth of Rs 2.5 lakhs", "date": "YYYY-MM-DD"},
            {"image_path": "/static/images/student_activities/009/12.webp", "event_name": "National Hackathon", "image_content": "ECE Dept students have received Finalist Medals and Certificates in the KAVACH-2023.  National Hackathon organized by MoE's Innovation Cell, Govt. of India", "date": "YYYY-MM-DD"},
            {"image_path": "/static/images/student_activities/009/13.webp", "event_name": "Smart India Hackathon", "image_content": "Present ECE III Yr Students Sowmya and Bowman team participated in Smart India Hackathon grand finale held at Andhra Pradesh in 2022", "date": "YYYY-MM-DD"}
        ]
    },
    {
        "dept_id": "010",
        "department_name": "English",
        "content": "",
        "images": [
            {"image_path": "/static/images/student_activities/010/1.webp", "image_content": "Description of Image 10_1", "event_name": "Event 10_1", "date": "YYYY-MM-DD"},
            {"image_path": "/static/images/student_activities/010/2.webp", "image_content": "Description of Image 10_2", "event_name": "Event 10_2", "date": "YYYY-MM-DD"},
            {"image_path": "/static/images/student_activities/010/3.webp", "image_content": "Description of Image 10_3", "event_name": "Event 10_3", "date": "YYYY-MM-DD"},
            {"image_path": "/static/images/student_activities/010/4.webp", "image_content": "Description of Image 10_4", "event_name": "Event 10_4", "date": "YYYY-MM-DD"},
            {"image_path": "/static/images/student_activities/010/5.webp", "image_content": "Description of Image 10_5", "event_name": "Event 10_5", "date": "YYYY-MM-DD"},
            {"image_path": "/static/images/student_activities/010/6.webp", "image_content": "Description of Image 10_6", "event_name": "Event 10_6", "date": "YYYY-MM-DD"},
            {"image_path": "/static/images/student_activities/010/7.webp", "image_content": "Description of Image 10_7", "event_name": "Event 10_7", "date": "YYYY-MM-DD"},
            {"image_path": "/static/images/student_activities/010/8.webp", "image_content": "Description of Image 10_8", "event_name": "Event 10_8", "date": "YYYY-MM-DD"},
            {"image_path": "/static/images/student_activities/010/9.webp", "image_content": "Description of Image 10_9", "event_name": "Event 10_9", "date": "YYYY-MM-DD"},
            {"image_path": "/static/images/student_activities/010/10.webp", "image_content": "Description of Image 10_10", "event_name": "Event 10_10", "date": "YYYY-MM-DD"}
        ]
    },
    {
        "dept_id": "011",
        "department_name": "Information Technology (IT)",
        "content": "",
        "images": [
            {"image_path": "/static/images/student_activities/011/1.webp", "image_content": "Subathra and Udayaravina of III IT won Second  prize(Cash Prize of Rs.22000) in Idea Incubators (Paper Presentation) in the event IDEA INCUBATORS conducted by Department of Spatial Informatics  at Saveetha Engineering College Description of Image 11_1", "event_name": "IDEA INCUBATORS ", "date": "2024-01-24"},
            {"image_path": "/static/images/student_activities/011/2.webp", "image_content": "Harish Ragav of II year IT B Section won first prize(Cash Prize of Rs.5000) in Research Showcase (Paper Presentation) in the event CISBOSSIUM'24 conducted by Department of Computer Science and Business System at R.M.K Engineering college ", "event_name": "CISBOSSIUM'24", "date": "2024-02-05"},
            {"image_path": "/static/images/student_activities/011/3.webp", "image_content": "Sesha Janani and Pratippa of III IT won Second Prize in Paper Presentation in PISTOBOLTZ'24 conducted by Department of Production Technology at Madras Institute of Technology ", "event_name": "PISTOBOLTZ'24", "date": "2024-03-16"},
            {"image_path": "/static/images/student_activities/011/4.webp", "image_content": "Vishnupriya and Srimathi of III IT won First Prize in Paper Presentation in TRIDENT'24 conducted by Department of Mechanical and Mechatronics  at Velammal Institute of technology ", "event_name": "TRIDENT'24", "date": "2024-02-23"},
            {"image_path": "/static/images/student_activities/011/5.webp", "image_content": "Nivedha of III IT won Second  Prize in Group Discussion, Shivani and Dhivyabharathi participated  in TRIDENT'24 conducted by Department of Mechanical and Mechatronics  at Velammal Institute of technology ", "event_name": "TRIDENT'24 ", "date": "2024-02-23"},
            {"image_path": "/static/images/student_activities/011/7.webp", "image_content": "Dharmaseelan, Vidyasagar,Abdul Afshith  of III IT won First  Prize in Techtangle Event  in PINNACLE'24 conducted by Department of Information Technology at SRM Easwari Engineering College ", "event_name": "PINNACLE'24", "date": "2024-02-23"},
            {"image_path": "/static/images/student_activities/011/8.webp", "image_content": "Vedavalli and Sruthinila of III Year IT won First Prize in paper presentation in SLICE V23 conducted by Department of Electronics and Communication Engineering at Loyala Icam Nungambakkam  ", "event_name": "SLICE V23 ", "date": "2023-09-16"},
            {"image_path": "/static/images/student_activities/011/6.webp", "image_content": "Vedavalli and Sruthinila of III Year IT won First Prize in paper presentation in HACKERZ conducted by Department of Computer Science and Engineering(Cyber Security) at Chennai Institute Of Technology ", "event_name": "HACKERZ", "date": "2023-09-19"},
            {"image_path": "/static/images/student_activities/011/9.webp", "image_content": "Abdul Kareem Faridh of II IT won Third Prize in paper presentation in PRECISION+ 2022 conducted by Department of Electronics and Instrumentation Engineering at B.S.Abdur Rahman crescent Institute of science & ", "event_name": "PRECISION+ 2022", "date": "2022-05-10"},
            {"image_path": "/static/images/student_activities/011/10.webp", "image_content": "Abdul Kareem Faridh of III IT won Third Prize in paper presentation in PINNACLE  2K23 conducted by Department of Information Technology at Easwari Engineering College  ", "event_name": "PINNACLE  2K23", "date": "2023-03-25"},
            {"image_path": "/static/images/student_activities/011/11.webp", "image_content": "Siddharth V, Harish Kumar M, Hariharan B, Nishanth Niruban M won 2nd prize in a paper presentation in Sairam Institute of Technology on 19.09.2024", "event_name": "", "date": "2024-09-19"},
            {"image_path": "/static/images/student_activities/011/12.webp", "image_content": "Syed Athaullah.R, Sindhuja.M, Jayashree.R and Thirulok Mugilan won 1st place in paper expo held at Adhi College of Engineering ", "event_name": "", "date": "2024-09-20"},
            {"image_path": "/static/images/student_activities/011/13.webp", "image_content": "Siddharth V,Harish Kumar M,Hariharan B,Nishanth Niruban M won 2nd prize in a paper presentation in Loyola Icam", "event_name": "", "date": "2024-09-29"},
            {"image_path": "/static/images/student_activities/011/14.webp", "image_content": "Syed Athaullah.R, Sindhuja.M, Jayashree.R and Thirulok Mugilan won 1st place in paper expo held at Loyola Icam ", "event_name": "", "date": "2024-09-28"},
            {"image_path": "/static/images/student_activities/011/15.webp", "image_content": "", "event_name": "", "date": ""},
            {"image_path": "/static/images/student_activities/011/16.webp", "image_content": "", "event_name": "", "date": ""},
            {"image_path": "/static/images/student_activities/011/17.webp", "image_content": "Mr.Dharani, IT, participated in  NTAC - Naval Technical Attachment camp at INS Shivaji , Mumbai  training and Industrial visit for naval engineering and mechanical base", "event_name": "", "date": ""},
            {"image_path": "/static/images/student_activities/011/18.webp", "image_content": "Mr. SGT Bharani R , IT, Overall championship trophy won by TamilNadu, Pondicherry & Andaman Nicobar directorate at EBSB camp (National level camp)", "event_name": "", "date": ""},
            {"image_path": "/static/images/student_activities/011/19.webp", "image_content": "Ms. Hemalatha,  IT Participated in Republic day camp during President house visit", "event_name": "", "date": ""},
            {"image_path": "/static/images/student_activities/011/20.webp", "image_content": "", "event_name": "", "date": ""},
            {"image_path": "/static/images/student_activities/011/21.webp", "image_content": "", "event_name": "", "date": ""},
            {"image_path": "/static/images/student_activities/011/22.webp", "image_content": "", "event_name": "", "date": ""},
            {"image_path": "/static/images/student_activities/011/23.webp", "image_content": "", "event_name": "", "date": ""},
            {"image_path": "/static/images/student_activities/011/24.webp", "image_content": "", "event_name": "", "date": ""},
            {"image_path": "/static/images/student_activities/011/25.webp", "image_content": "", "event_name": "", "date": ""},
            {"image_path": "/static/images/student_activities/011/26.webp", "image_content": "", "event_name": "", "date": ""}
        ]
    },
    {
        "dept_id": "013", 
        "department_name": "Mechancial Engineering (MECH)",
        "content": "",
        "images": [
            {"image_path": "/static/images/student_activities/013/1.webp", "image_content": "Final Year Student Mr.G.Yashwanth Kumar secured Gold medal in Anna University Inter Zone Best Physique men Tournament held @ Paavai Engineering College, Namakkal ", "event_name": "Anna University Inter Zone Best Physique men Tournament", "date": "2024-12-21"},
            {"image_path": "/static/images/student_activities/013/2.webp", "image_content": "Final year and third year students were participated in Maze Solver Challenge and Drone Racing (FPV) Challenge of TechnoXian World Cup 2024 (Technical event competition) held at Noida Stadium Complex, Noida, India ", "event_name": "TECHNOXIAN ’24", "date": "2024-02-24"},
            {"image_path": "/static/images/student_activities/013/3.webp", "image_content": "Final year students M.Ganesh and K.Indirakumar design was recognized as Top 15 designs from 200 participants at ICT design competition. 200 students from 72 engineering colleges, 16 states were participated in this 24 hours design challenge.", "event_name": "ICT Academy design competition 2024", "date": "2024-07-26"},
            {"image_path": "/static/images/student_activities/013/4.webp", "image_content": "Indira kumar.K of Third year student won 1st prize in kumite and 2nd prize in kata in International Okinawa Goji-Rru karate open championship held at Coimbatore ", "event_name": "International Okinawa Goji-Rru karate open championship", "date": "2023-10-15"},
            {"image_path": "/static/images/student_activities/013/5.webp", "image_content": "Gokul B of Final year student has participated in National level tech-fest Invente'23, organized by SSN College of Engineering & Shiv Nadar Univerisy, Chennai and won first prize & cash of Rs.2,500/- in Paper Presentation event.", "event_name": "National level Tech-fest Invente'23", "date": "2023-10-05"},
            {"image_path": "/static/images/student_activities/013/6.webp", "image_content": "Ajay T.K. of third year student has participated in the State Level Power Lifters Championship and secured fourth place in the 6.5 kg weight class. The event was organised by Aarogreen Fitness & Chengai Kanchi Power Lifter Association.", "event_name": "State Level Power Lifters Championship", "date": "2023-10-01"},
            {"image_path": "/static/images/student_activities/013/7.webp", "image_content": " Srinivas of Final year and Saravanaraj of third year students have participated in Anna University Zonal Table Tennis tournament and secured Runner up position. The match was held at S.A Engineering College, Chennai ", "event_name": "Anna University Zonal Table Tennis tournament", "date": "2023-09-26"},
            {"image_path": "/static/images/student_activities/013/8.webp", "image_content": "Gokul B, Suresh K, & Muthuraja of Final year students have participated in National Level Technical Symposium (TORQ 2k23), organized by Loyola College of Engineering and Technology, Chennai on and won First prize and the cash of Rs.2,000/- in EV racing event.", "event_name": "National Level Technical Symposium", "date": "2023-09-16"},
            {"image_path": "/static/images/student_activities/013/9.webp", "image_content": "Final year students have participated in National Electric Tractor Design Championship (NETDC-23) held at Bannari Amman Institute of Technology, Sathyamangalam and won 3rd place in Business plan event", "event_name": "National Electric Tractor Design Championship", "date": "2023-08-18"},
            {"image_path": "/static/images/student_activities/013/10.webp", "image_content": "Indira kumar K of Third year student has participated in Shivamogga 4th open International karate championship held at Shimoga city, Karnataka. He secured First place in Both (kumite and kata) category Above 18 Years.", "event_name": "Shivamogga 4th open International karate championship", "date": "2023-08-05"},
            {"image_path": "/static/images/student_activities/013/11.webp", "image_content": "Students have won the Best Innovation Award in the prestigious National Level Electric Two-Wheeler Design Competition 2023 organized by SAEINDIA Southern Section conducted at Rajalakshmi Engineering college, Chennai and earned them a cash prize of Rs 10,000.", "event_name": "National Level Electric Two-Wheeler Design Competition 2023", "date": "2023-07-22"},
            {"image_path": "/static/images/student_activities/013/12.webp", "image_content": "Sriram R of third year student has got runner-up in EK Bharat Shreshtha Bharat camp held at JAKLI RC, Srinagar ", "event_name": "EK Bharat Shreshtha Bharat camp", "date": "2023-02-26"},
            {"image_path": "/static/images/student_activities/013/13.webp", "image_content": " Srivarshan, Rupesh kanna and Thirumal R of third year  students secured third position in CAD modelling in the National Level Student Convention 2022-2023 Organised by SAEISS held at SRM Easwari Engineering College, Chennai.", "event_name": "National Level Student Convention 2022-2023", "date": "2023-06-18"},
            {"image_path": "/static/images/student_activities/013/14.webp", "image_content": "SAE - Bi Cycle design competition was held at PSNA College of Engineering and Technology, Dindigul. Our students Team CYCLONE won the second prize for Best Dynamic Performance award with the cash prize of Rs.8,000/-.", "event_name": "SAE - Bi Cycle design competition 2023", "date": "2023-04-01"},
            {"image_path": "/static/images/student_activities/013/15.webp", "image_content": "Third year student Saravana Raj.S won Gold medal in Table tennis (Doubles) - CM Trophy 2022-23.", "event_name": "Table tennis (Doubles) - CM Trophy", "date": "2023-02-07"},
            {"image_path": "/static/images/student_activities/013/16.webp", "image_content": "Ananth Sai Shankar V of final year student received the Certificate of Merit from Shri Jatindra Nath Swain, I.A.S., Secretary, Department of Fisheries, Ministry of  Fisheries, Animal Husbandry & Dairying, Government of India under the category “National Design Challenge on Innovative design of Mobile Kiosk for Fish vending” conducted by CII. Felicitation ceremony was held at Gulmohar Hall, Habitat Centre, Delhi.", "event_name": "National Design Challenge on Innovative design of Mobile Kiosk for Fish vending", "date": "2022-10-27"},
            {"image_path": "/static/images/student_activities/013/17.webp", "image_content": "SAEISS design competition organized by Dr. G. Padmanabham Memorial Electric Two Wheeler Design Competition 2022 held at SRM University, Ramapuram.  Our students named as Team infinity secured best Maneuverability award in the competition and received a cash prize of Rs. 7,500/-.", "event_name": "Electric Two Wheeler Design Competition 2022", "date": "2022-10-17"},
            {"image_path": "/static/images/student_activities/013/18.webp", "image_content": "A Student from along with other Department students participated in the Accenture Innovation Challenge 2021, a National level competition in which 2,800 innovative ideas from over 10,000 students were presented and our team secured grand prize winner (Overall first) and received Rs 1 lakh cash prize and Apple IMac.", "event_name": "Accenture Innovation Challenge 2021", "date": "2021-11-24"}
        ]
    },
    {
        "dept_id": "014",
        "department_name": "Tamil",
        "content": "",
        "images": [
           ]
    },
    {
        "dept_id": "015", 
        "department_name": "Physics",
        "content": "",
        "images": [
           ]
    },
    {
        "dept_id": "016",
        "department_name": "M.E. Computer Science Engineering",
        "content": "Students' achievements are a testament to their hard work, dedication, and resilience in the pursuit of academic and personal growth. From excelling in academics and securing top grades to showcasing talent in sports, arts, and extracurricular activities, their accomplishments reflect a well-rounded development. Participation in science fairs, debates, and cultural events highlights their creativity and critical thinking, while community service projects demonstrate their commitment to making a positive impact. These achievements not only inspire their peers but also pave the way for future opportunities, building confidence and a strong foundation for lifelong success.",
        "images": [
           ]
    },
    {
        "dept_id": "017", 
        "department_name": "Master of Business Administration (MBA)",
        "content": "",
        "images": [
            {"image_path": "/static/images/student_activities/017/1.webp", "image_content": "", "event_name": "Five Days Profit Challenge", "date": "18.09.2024"},
            {"image_path": "/static/images/student_activities/017/2.webp", "image_content": "", "event_name": "Five Days Profit Challenge", "date": "18.09.2024"},
            {"image_path": "/static/images/student_activities/017/3.webp", "image_content": "", "event_name": "Five Days Profit Challenge", "date": "18.09.2024"},
            {"image_path": "/static/images/student_activities/017/4.webp", "image_content": "", "event_name": "Five Days Profit Challenge", "date": "18.09.2024"},
            {"image_path": "/static/images/student_activities/017/5.webp", "image_content": "Communication battle was conducted to induce the various talents and managerial skills of the students of MBA.", "event_name": "Intra Collegiate Event Communication Battle ", "date": ""},
            {"image_path": "/static/images/student_activities/017/6.webp", "image_content": "Communication battle was conducted to induce the various talents and managerial skills of the students of MBA.", "event_name": "Intra Collegiate Event Communication Battle ", "date": ""},
            {"image_path": "/static/images/student_activities/017/7.webp", "image_content": "Students have participated in OBT at Pegasus Institute at Mambakkam.", "event_name": "OBT-Out Bound Training", "date": ""},
            {"image_path": "/static/images/student_activities/017/8.webp", "image_content": "Students have participated in OBT at Pegasus Institute at Mambakkam.", "event_name": "OBT-Out Bound Training", "date": ""},
            {"image_path": "/static/images/student_activities/017/9.webp", "image_content": "Students have participated in OBT at Pegasus Institute at Mambakkam.", "event_name": "OBT-Out Bound Training", "date": ""},
            {"image_path": "/static/images/student_activities/017/10.webp", "image_content": "Students have participated in OBT at Pegasus Institute at Mambakkam.", "event_name": "OBT-Out Bound Training", "date": ""},
            {"image_path": "/static/images/student_activities/017/11.webp", "image_content": "", "event_name": " Intreview with The Entrepreneur", "date": "","status":"true","video_link":"https://youtube.com/playlist?list=PLPKpmfy3mAnJ5vPofahoZzyYGk_zQ0b_U&feature=shared"},
            {"image_path": "/static/images/student_activities/017/12.webp", "image_content": "", "event_name": " Intreview with The Entrepreneur", "date": "","status":"true","video_link":"https://youtube.com/playlist?list=PLPKpmfy3mAnJ5vPofahoZzyYGk_zQ0b_U&feature=shared"},
            {"image_path": "/static/images/student_activities/017/13.webp", "image_content": "", "event_name": " Intreview with The Entrepreneur", "date": "","status":"true","video_link":"https://youtube.com/playlist?list=PLPKpmfy3mAnJ5vPofahoZzyYGk_zQ0b_U&feature=shared"},
            {"image_path": "/static/images/student_activities/017/14.webp", "image_content": "LOCALITY BUSINEESS CONSULTANCY is a students activity that was assigned to the students for their welfare and exposure on consultation.", "event_name": " LOCALITY BUSINESS CONSULTANCY", "date": ""},
            {"image_path": "/static/images/student_activities/017/15.webp", "image_content": "LOCALITY BUSINEESS CONSULTANCY is a students activity that was assigned to the students for their welfare and exposure on consultation.", "event_name": " LOCALITY BUSINESS CONSULTANCY", "date": ""},
            {"image_path": "/static/images/student_activities/017/16.webp", "image_content": "LOCALITY BUSINEESS CONSULTANCY is a students activity that was assigned to the students for their welfare and exposure on consultation.", "event_name": " LOCALITY BUSINESS CONSULTANCY", "date": ""},
            {"image_path": "/static/images/student_activities/017/17.webp", "image_content": "LOCALITY BUSINEESS CONSULTANCY is a students activity that was assigned to the students for their welfare and exposure on consultation.", "event_name": " LOCALITY BUSINESS CONSULTANCY", "date": ""},
            {"image_path": "/static/images/student_activities/017/18.webp", "image_content": "Students were motivated to adopt a drop shipping model and was asked to do a business of their choice", "event_name": "Drop Shipping Model For Students", "date": ""},
            {"image_path": "/static/images/student_activities/017/19.webp", "image_content": "Students were motivated to adopt a drop shipping model and was asked to do a business of their choice", "event_name": "Drop Shipping Model For Students", "date": ""},
            {"image_path": "/static/images/student_activities/017/20.webp", "image_content": "Students were motivated to adopt a drop shipping model and was asked to do a business of their choice", "event_name": "Drop Shipping Model For Students", "date": ""},
            {"image_path": "/static/images/student_activities/017/21.webp", "image_content": "Students were motivated to adopt a drop shipping model and was asked to do a business of their choice", "event_name": "Drop Shipping Model For Students", "date": ""},
            {"image_path": "/static/images/student_activities/017/22.webp", "image_content": "Students were motivated to adopt a drop shipping model and was asked to do a business of their choice", "event_name": "Drop Shipping Model For Students", "date": ""},
            {"image_path": "/static/images/student_activities/017/23.webp", "image_content": "Students were motivated to adopt a drop shipping model and was asked to do a business of their choice", "event_name": "Drop Shipping Model For Students", "date": ""},
            {"image_path": "/static/images/student_activities/017/24.webp", "image_content": "Students were motivated to adopt a drop shipping model and was asked to do a business of their choice", "event_name": "Drop Shipping Model For Students", "date": ""},
            {"image_path": "/static/images/student_activities/017/25.webp", "image_content": "Students were motivated to adopt a drop shipping model and was asked to do a business of their choice", "event_name": "Drop Shipping Model For Students", "date": ""},
            {"image_path": "/static/images/student_activities/017/26.webp", "image_content": "", "event_name": "STEVVE", "date": "","status":""},
            {"image_path": "/static/images/student_activities/017/27.webp", "image_content": "", "event_name": "STEVVE", "date": "","status":""},
            {"image_path": "/static/images/student_activities/017/28.webp", "image_content": "", "event_name": "STEVVE", "date": "","status":""},
            {"image_path": "/static/images/student_activities/017/29.webp", "image_content": "", "event_name": "STEVVE", "date": "","status":""},
            {"image_path": "/static/images/student_activities/017/30.webp", "image_content": "", "event_name": "STEVVE", "date": "","status":""},
            {"image_path": "/static/images/student_activities/017/31.webp", "image_content": "", "event_name": "STEVVE", "date": "","status":""},
            {"image_path": "/static/images/student_activities/017/32.webp", "image_content": "", "event_name": "STEVVE", "date": "","status":""},
            {"image_path": "/static/images/student_activities/017/33.webp", "image_content": "", "event_name": "STEVVE", "date": "","status":""},
            {"image_path": "/static/images/student_activities/017/34.webp", "image_content": "", "event_name": "International workshop on social enterpreneurship ", "date": ""},
            {"image_path": "/static/images/student_activities/017/35.webp", "image_content": "", "event_name": "International workshop on social enterpreneurship ", "date": ""},
            {"image_path": "/static/images/student_activities/017/36.webp", "image_content": "", "event_name": "International workshop on social enterpreneurship ", "date": ""},
            {"image_path": "/static/images/student_activities/017/37.webp", "image_content": "", "event_name": "International workshop on social enterpreneurship ", "date": ""},
            {"image_path": "/static/images/student_activities/017/38.webp", "image_content": "", "event_name": "International workshop on social enterpreneurship ", "date": ""},
            {"image_path": "/static/images/student_activities/017/39.webp", "image_content": "", "event_name": "International workshop on social enterpreneurship ", "date": ""},
            {"image_path": "/static/images/student_activities/017/40.webp", "image_content": "", "event_name": "International workshop on social enterpreneurship ", "date": ""},
            {"image_path": "/static/images/student_activities/017/41.webp", "image_content": "", "event_name": "International workshop on social enterpreneurship ", "date": ""},
            {"image_path": "/static/images/student_activities/017/42.webp", "image_content": "", "event_name": "International workshop on social enterpreneurship ", "date": ""},
            {"image_path": "/static/images/student_activities/017/43.webp", "image_content": "", "event_name": "International workshop on social enterpreneurship ", "date": ""},
            {"image_path": "/static/images/student_activities/017/44.webp", "image_content": "", "event_name": "International workshop on social enterpreneurship ", "date": ""},
            {"image_path": "/static/images/student_activities/017/45.webp", "image_content": "", "event_name": "International workshop on social enterpreneurship ", "date": ""},
            {"image_path": "/static/images/student_activities/017/46.webp", "image_content": "", "event_name": "International workshop on social enterpreneurship ", "date": ""},
            {"image_path": "/static/images/student_activities/017/47.webp", "image_content": "", "event_name": "International workshop on social enterpreneurship ", "date": ""}

        ]
    }

]