{
   "curriculums": [
  {
    "regulation": "2019",
    "viewUrl": "/path-to-view-regulation-2019",
    "downloadUrl": "/path-to-download-regulation-2019",
    "subParts": [
      {
        "regulation": "2021 - 2022",
        "viewUrl": "/path-to-view-regulation-2021",
        "downloadUrl": "/path-to-download-regulation-2021"
      }
    ]
  },
  {
    "regulation": "2023",
    "viewUrl": "/path-to-view-regulation-2023",
    "downloadUrl": "/path-to-download-regulation-2023"
  }
],
    "psos": [
      { "id": 1, "description": "Apply the concepts of Artificial Intelligence to provide solutions for the real time problems and to integrate the professional skills with recent tools and technologies to cope with the dynamic AI needs." },
      { "id": 2, "description": " Create a concrete foundation and enlighten the innovation, research and entrepreneur skills in the field of Artificial Intelligence and Data science." }
    ],
    "pos": [
      { "id": 1, "name": "Engineering Knowledge", "content": "Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization for the solution of complex engineering problems." },
      { "id": 2, "name": "Problem Analysis", "content": "Identify, formulate, research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences." },
      { "id": 3, "name": "Design and Development of Solutions", "content": "Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for public health and safety, and cultural, societal, and environmental considerations." },
      { "id": 4, "name": "Investigations of Complex Problems", "content": "Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions." },
      { "id": 5, "name": "Modern Tool Usage", "content": "Create, select, and apply appropriate techniques, resources, and modern engineering and AI and Data Science tools, including prediction and modelling to complex engineering activities, with an understanding of the limitations." },
      { "id": 6, "name": "The Engineer and Society", "content": "Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice." },
      { "id": 7, "name": "Environment and Sustainability", "content": "Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development." },
      { "id": 8, "name": "Ethics", "content": "Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice." },
      { "id": 9, "name": "Individual and Team Work", "content": "Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings." },
      { "id": 10, "name": "Communication", "content": "Communicate effectively on complex engineering activities with the engineering community and with the society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions" },
      { "id": 11, "name": "Project Management and Finance", "content": "Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments."},
      { "id": 12, "name": "Life-long Learning", "content": "Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change." }
    ]
  }
  